In [1]:
import sqlite3 as sq3
import pandas as pd

In [2]:
conn = sq3.connect('test.db')
cu = conn.cursor()
cu.execute('''CREATE TABLE IF NOT EXISTS students
             (rollno real, name text, class real)''')
cu.execute('''DELETE FROM students''')

In [3]:
pd.read_sql_query("SELECT * FROM students", conn)

Empty DataFrame
Columns: [rollno, name, class]
Index: []

In [6]:
cu.execute('''INSERT INTO students VALUES(1,'Alan',1)''')

In [5]:
students = [
             (2, 'Bob', 1),
             (3, 'Cathy', 1)
             (1, 'Alan', 1),
            ]
cu.executemany('INSERT INTO students VALUES(?,?,?)',students)

In [7]:
print(cu.lastrowid)

5

In [8]:
pd.read_sql_query("SELECT * FROM students", conn)

   rollno   name  class
0     1.0   Glen    8.0
1     1.0   Alan    1.0
2     2.0    Bob    1.0
3     3.0  Cathy    1.0
4     4.0   Doug    1.0

In [9]:
conn.commit()
conn.close()

## Reference
- <https://pythonexamples.org/python-sqlite3-insert-into-table/>